 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROCDIV.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 SOME-DATA.
 PROCEDURE DIVISION
    USING 
       SOME-DATA ANY
       BY VALUE 1 ANY.