 IDENTIFICATION DIVISION.
 PROGRAM-ID. SCTN.
 PROCEDURE DIVISION.
 SOME-SECTION SECTION.
     STOP RUN.
 SOME-SECTION SECTION.
     DISPLAY "This section has been redefined".