 IDENTIFICATION DIVISION.
 PROGRAM-ID. SCTN.
 PROCEDURE DIVISION.
 INIT.
    PERFORM INIT.
 SOME-SECTION SECTION.
    INIT.
       PERFORM INIT.
    AFTER-INIT.
       STOP RUN.