000100 Identification Division.                                         24.02.99
000200 Program-ID.                                                      24.02.99
000300  HELLOWORLD.                                                     24.02.99
000400 Procedure Division.                                              24.02.99
001900     COPY CopySuppress                                            24.02.99
001910                   REPLACING ==Needle.== BY                       24.02.99
001920                             ==Needle-SRC.==.                     24.02.99
001930     COPY CopySuppress SUPPRESS                                   24.02.99
001940                   REPLACING ==Needle.== BY                       24.02.99
001950                             ==Needle-DST.== SUPPRESS.            24.02.99
