 IDENTIFICATION DIVISION.
 PROGRAM-ID. CLSSTMT.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT SOMEFILE1A ASSIGN TO 'somefile1a.txt'.
          SELECT SOMEFILE1B ASSIGN TO 'somefile1b.txt'.
          SELECT SOMEFILE2 ASSIGN TO 'somefile2.txt'.
          SELECT SOMEFILE3 ASSIGN TO 'somefile3.txt'.
          SELECT SOMEFILE4 ASSIGN TO 'somefile4.txt'.
          SELECT SOMEFILE5 ASSIGN TO 'somefile5.txt'.
 DATA DIVISION.
    FILE SECTION.
         FD SOMEFILE1A.
         FD SOMEFILE1B.
         FD SOMEFILE2.
         FD SOMEFILE3.
         FD SOMEFILE4.
         FD SOMEFILE5.
 PROCEDURE DIVISION.
    CLOSE
       SOMEFILE1A UNIT FOR REMOVAL WITH LOCK
       SOMEFILE1B REEL.
    CLOSE
       SOMEFILE2 WITH LOCK.
    CLOSE
       SOMEFILE3 WITH WAIT USING CLOSE-DISPOSITION ORDERLY.
    CLOSE
       SOMEFILE4 WITH NO WAIT USING ASSOCIATED-DATA 4.
    CLOSE
       SOMEFILE5 WITH NO WAIT USING ASSOCIATED-DATA-LENGTH SOMEID1.