 IDENTIFICATION DIVISION.
 PROGRAM-ID. GOTOCKSTMT.
 PROCEDURE DIVISION.
    IF SOMECOND1 THEN
       DISPLAY 'thentext'
    ELSE
       DISPLAY 'elsetext'
    END-IF.