000100 IDENTIFICATION DIVISION.                                         12345678
000200 PROGRAM-ID.                                                      12345678
000300    ENDRMRKS.                                                     12345678
001400 REMARKS.                                                         12345678
001500     SOMEREM.                                                     12345678
001600 END-REMARKS.                                                     12345678