 IDENTIFICATION DIVISION.
 PROGRAM-ID. ASSIGNTOEXT.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT TEACHER ASSIGN TO EXTERNAL SOME-DAT.