 IDENTIFICATION DIVISION.
 PROGRAM-ID. ASSIGNTO.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT TEACHER ASSIGN TO DISK.