 IDENTIFICATION DIVISION.
 PROGRAM-ID. ASSIGNTODYN.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT TEACHER ASSIGN TO DYNAMIC SOME-DAT.