 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROLDISPLAY.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       file-control.
          select standard-input assign to keyboard.
          select standard-output assign to display.