 IDENTIFICATION DIVISION.
 PROGRAM-ID. TERMINATESTMT.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT SOMEFILE1 ASSIGN TO 'somefile1.txt'.
 DATA DIVISION.
    FILE SECTION.
       FD SOMEFILE1.
          01 ITEMS.
 PROCEDURE DIVISION.
    WRITE ITEMS 
       FROM SOMEID1
       BEFORE ADVANCING 3 LINES
       AT EOP DISPLAY 'at end of page'
       NOT AT EOP DISPLAY 'not at end of page'
       INVALID KEY DISPLAY 'invalid key'
       NOT INVALID KEY DISPLAY 'valid key'.