 IDENTIFICATION DIVISION.
 PROGRAM-ID. REPGRPDESCVERT.
 DATA DIVISION.
    REPORT SECTION.
    RD REPORT1.
       01 SOMEDATA1
          USAGE IS DISPLAY.
          04 SOMEDATA1
             USAGE IS DISPLAY.
       02 SOMEDATA1
             USAGE IS DISPLAY.
       01 SOMEDATA1
             USAGE IS DISPLAY.