 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONDTN.
 PROCEDURE DIVISION.
    IF NOT SOME-COND (SOME-INDEX
                    ,SOME-MONTH)
       STOP RUN
    END-IF.
