       CBL APOST,AWO
       CBL NOADV,NOCMPR2,COMPILE,DATA(31)
       CBL NODECK,NODUMP,NODBCS,FASTSRT,NOFLAGMIG
       CBL NOFLAGSTD,LANGUAGE(EN),LIB,LINECOUNT(60),MAP
       CBL NONAME,NONUMBER,NOSEQUENCE,NUMPROC(NOPFD),OBJECT,OFFSET
       CBL NOVBREF,NOWORD
       CBL OUTDD(PPTDBG),RENT,SOURCE
       CBL SPACE(1),NOSSRANGE,NOTERM,NOTEST
       CBL TRUNC(STD),ZWB
       CBL ADV
       Identification Division.
       Program-ID.
        Opts.