000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONFIGSECTION.
000400 AUTHOR. SOMEAUTH.
000600 INSTALLATION. SOMEINSTALL.
000800 DATE-COMPILED. SOMECOMPILED.
001000 DATE-WRITTEN. SOMEWRITTEN.
001200 SECURITY. SOMESEC.
001400 REMARKS. SOMEREM.