000100 IDENTIFICATION DIVISION.
000100 PROGRAM-ID. INLINE-COMMENT.
000100   PROCEDURE DIVISION.
000100       *>DISPLAY SOME-TEXT.
000100       DISPLAY SOME-TEXT-2.