000050* A Comment line                                   
000100 Identification Division.                                         
000200 Program-ID.                                                      
000300  HELLOWORLD.                                                     
000400 Procedure Division.                                                              
000500  Display "Hello world".                                           
000600  STOP RUN.                                                       