       PROCESS XOPTS(SP APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL) ARITH(EXTEND)
       Identification Division.
       Program-ID. 
        Opts.
       Procedure Division.