       PROCESS XOPTS(APOST)
       PROCESS NOSEQ LIB OPTIMIZE(FULL)
       Identification Division.
       Program-ID. 
        Opts.
       Procedure Division.