000010 IDENTIFICATION DIVISION.                                         00000000
000020******************************************************************00000000
000050 PROGRAM-ID.       ABC01      .                                   00000000
000060******************************************************************00000000
000100 AUTHOR.           Tester.                                        00000000
000140 ENVIRONMENT DIVISION.                                            00000000
000150 CONFIGURATION SECTION.                                           00000000
000160 SPECIAL-NAMES.                                                   00000000
000170     DECIMAL-POINT IS COMMA.                                      00000000
000180 OBJECT-COMPUTER.      IBM-370.                                   00000000      
000180 SOURCE-COMPUTER.      IBM-370.                                   00000000      
000190 INPUT-OUTPUT SECTION.                                            00000000
000200 FILE-CONTROL.                                                    00000000

