 IDENTIFICATION DIVISION.
 PROGRAM-ID. EMPTYSRCCOMP.
 ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
   SOURCE-COMPUTER.
   OBJECT-COMPUTER.
  SPECIAL-NAMES.