 IDENTIFICATION DIVISION.
 PROGRAM-ID. MULTSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 77 SOMEID2 PIC 9(10).
 77 SOMEID3 PIC 9(10).
 77 SOMEID4 PIC 9(10).
 PROCEDURE DIVISION.
    MULTIPLY SOMEID1 BY
       SOMEID2 GIVING SOMEID3 SOMEID4 ROUNDED
       ON SIZE ERROR DISPLAY 'on size error'
       NOT ON SIZE ERROR DISPLAY 'not on size error'.