 IDENTIFICATION DIVISION.
 PROGRAM-ID. GOTOCKSTMT.
 PROCEDURE DIVISION.
 SOMEPROC1.
    GO TO SOMEPROC1.
    GO TO SOMEPROC2 SOMEPROC3 DEPENDING ON SOMEDATA1.
    GO MORE-LABELS.
 SOMEPROC2.
    Display "Proc2".
 SOMEPROC3.
    Display "Proc3".