 IDENTIFICATION DIVISION.
 PROGRAM-ID. COMMDESCINPUT.
 DATA DIVISION.
    COMMUNICATION SECTION.
    CD SOMECD FOR OUTPUT
       DESTINATION COUNT IS SOMEDESTCOUNT
       TEXT LENGTH IS SOMETEXTLENGTH
       STATUS KEY IS SOMESTATUSKEY
       DESTINATION TABLE OCCURS 5 TIMES INDEXED BY SOMEINDEX1 SOMEINDEX2
       ERROR KEY IS SOMEERRORKEY
       SYMBOLIC DESTINATION IS SOMEDEST.
    01 WS-PERSON.
       05 WS-PERSON-ID PIC 9(5).