 IDENTIFICATION DIVISION.
 PROGRAM-ID. RECEIVEINTOSTMT.
 PROCEDURE DIVISION.
    RECEIVE SOMECD1 MESSAGE INTO SOMEID1
       NO DATA DISPLAY 'no data'
       WITH DATA DISPLAY 'WITH DATA'.