000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500   IF LINE-COUNTER EQUAL TO ZERO
000600     Display "Hello world"
000700   END-IF.
000800
000500   IF LINE-COUNTER = ZERO
000600     Display "Hello world"
000700   END-IF.