 IDENTIFICATION DIVISION.
 PROGRAM-ID. SCRNUSING.
 DATA DIVISION.
 SCREEN SECTION.
    01 SOME-SCREEN USING SOME-DATA.
 WORKING-STORAGE SECTION.
    01 SOME-DATA.