 IDENTIFICATION DIVISION.
 PROGRAM-ID. SOMESCREENAPP.
 DATA DIVISION.
 SCREEN SECTION.
    01 SOMESCREEN1.
       05 BLANK SCREEN.
       05 SOMELINE1 LINE 1 COLUMN 16 VALUE "E M P L O Y E E" HIGHLIGHT.
       05 LINE 2 COLUMN 35 VALUE "A D D R E S S" LOWLIGHT.
    01 SOMESCREEN2.