 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEDN1 PIC 9(10).
 77 SOMEDN2 PIC 9(10).
 PROCEDURE DIVISION.
     SUBTRACT CORR SOMEDN1 FROM SOMEDN2 ROUNDED.