 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 77 SOMEID2 PIC 9(10).
 77 SOMEID3 PIC 9(10).
 PROCEDURE DIVISION.
     SUBTRACT SOMEID1 1 FROM SOMEID2 SOMEID3 ROUNDED.