 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 PROCEDURE DIVISION.
     SUBTRACT SOMEID1 '1' FROM SOMEID2 SOMEID3 ROUNDED.