000050$SET DIALECT(MF) NOTRUNC NOBOUND                                  12345678
000100 Identification Division.                                         12345678
000200 Program-ID.                                                      12345678
000300  SETCOMPILERDIRECTIVE.                                           12345678