000100 Identification Division.                                         26.10.94
000200   Program-ID. DeformedLine.                                      26.10.94
000400 Procedure Division.                                              26.10.94
000100 DATA DIVISION.                                                   26.10.94
000100 WORKING-STORAGE SECTION.                                         26.10.94
007100        10 P321-FILLER       PIC X(36).                           26.10.94
007200
007300     05 FILLER REDEFINES P321-LISTINFO.                           26.10.94