000100 Identification Division.                                         12345678
000100 Program-ID. ExecSql.                                             12345678
000100                                                                  12345678
000100 Data Division.                                                   12345678
000100 Working-Storage Section.                                         12345678
000100                                                                  12345678
000100 EXEC SQL BEGIN DECLARE SECTION END-EXEC.                         12345678
000100                                                                  12345678
000100 01 userid pic x(8).                                              12345678
000100                                                                  12345678
000100 EXEC SQL END DECLARE SECTION END-EXEC.                           12345678
000100                                                                  12345678
000100 Procedure Division.                                              12345678
000100  EXEC SQL CONNECT TO demo END-EXEC                               12345678
000100                                                                  12345678
000100  Display "Hello world".                                          12345678
000100  STOP RUN.                                                       12345678