000100 IDENTIFICATION DIVISION.                                         12345678
000200 PROGRAM-ID.                                                      12345678
000300    CONFIGSECTION.                                                12345678
000400  AUTHOR.                                                         12345678
000500     SOMEAUTH.                                                    12345678