000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. INLINE-COMMENT.                                      12345678
000100   PROCEDURE DIVISION.                                            12345678
000100       *>DISPLAY SOME-TEXT.                                       12345678
000100       DISPLAY SOME-TEXT-2.                                       12345678