000000 IDENTIFICATION DIVISION.                                         12345678
000000 PROGRAM-ID. LNECONTDBLQ.                                         12345678
000000 PROCEDURE DIVISION.                                              12345678
000000    DISPLAY '----'                                                12345678
000000-      '===='                                                     12345678