000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. LINECONTWS.                                          12345678
000100 PROCEDURE DIVISION                                               12345678
000100    DISPLAY  "this is some literal with trailing whitespace       12345678
000100-        " and it ends here".                                     12345678