000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. LINECONTWS.                                          12345678
000100 DATA DIVISION.                                                   12345678
000100 WORKNGSTORAGE SECTION.                                           12345678
000100     SOME-DATA PICTURE A(36) JUSTIFIED RIGHT.                     12345678
000100 PROCEDURE DIVISION.                                              12345678
000100     MOVE                                   "                     12345678
000100-        "              A" TO SOME-DATA.                          12345678