000000 IDENTIFICATION DIVISION.                                         12345678
000000 PROGRAM-ID. LNECONTESCQ.                                         12345678
000000 ENVIRONMENT DIVISION.                                            12345678
000000 CONFIGURATION SECTION.                                           12345678
000000 SPECIAL-NAMES.                                                   12345678
000000     ALPHABET                                                     12345678
000000     THE-BIG-OL-LITERAL-ALPHABET IS "A+0B-1C*2D/3E=4Fl5G,6H;7I.8J"12345678
000000-    ""9K(L)M>N<O PQRSTUVWXYZ".                                   12345678