000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. LINECONTMLT.                                         12345678
000100 DATA DIVISION.                                                   12345678
000100 WORKINGSTORAGE SECTION.                                          12345678
000100     02 SOME-DAT PIC IS X(99) VALUE IS    " FEATURE               12345678
000100-    "SS  PARAGRAPH-NAME                                          12345678
000100-    "       REMARKS".                                            12345678