000000 IDENTIFICATION DIVISION.                                         12345678
000000 PROGRAM-ID.                                                      12345678
000000     LNECNTAMBG.                                                  12345678
000000 DATA DIVISION.                                                   12345678
000000 WORKING-STORAGE SECTION.                                         12345678
000000 77  PROCEDURE                                                    12345678
000000-    DIVISION PICTURE X.                                          12345678