000100 IDENTIFICATION DIVISION.                                         SC1000.1
000100 PROGRAM-ID.                                                      SC1000.1
000100     SECURITYTEST.                                                SC1000.1
000100 SECURITY.                                                        SC1000.1
000100     NONE.                                                        SC1000.1
000100                                                                  SC1000.1
000100     SOME QUOTE"S                                                 SC1000.1
000100                                                                  SC1000.1
000100 DATA DIVISION.                                                   SC1000.1
000100 WORKING-STORAGE SECTION.                                         SC1000.1
000100 01  LEVEL1.                                                      SC1000.1
000100     02 LEVEL2 PIC X(52) VALUE IS                                 SC1000.1
000100     "COPY, TEST.".                                               SC1000.1