 IDENTIFICATION DIVISION.
 PROGRAM-ID. OPENSTMT.
    DATA DIVISION.
      FILE SECTION.
         FD SOMEFILE1.
         FD SOMEFILE2.
         FD SOMEFILE3.
         FD SOMEFILE4.
         FD SOMEFILE5.
 PROCEDURE DIVISION.
    OPEN
       INPUT 
          SOMEFILE1 WITH NO REWIND
          SOMEFILE2 REVERSED
       OUTPUT
          SOMEFILE3 WITH NO REWIND
       I-O
          SOMEFILE4 SOMEFILE5
       EXTEND
          SOMEFILE4 SOMEFILE5.