 IDENTIFICATION DIVISION.
 PROGRAM-ID. OPENSTMT.
 PROCEDURE DIVISION.
    OPEN
       INPUT 
          SOMEFILE1 WITH NO REWIND
          SOMEFILE2 REVERSED
       OUTPUT
          SOMEFILE3 WITH NO REWIND
       I-O
          SOMEFILE4 SOMEFILE5
       EXTEND
          SOMEFILE6 SOMEFILE7.