000100 IDENTIFICATION DIVISION.
000100 PROGRAM-ID. EXECSQL.
000100 PROCEDURE DIVISION.
000100   EXEC SQL
000100     SELECT TEACHER-ID FROM TBL.TEACHR
000100   END-EXEC.
000100   STOP RUN.