000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Environment Division.
000500  COPY MSG-IO-SEL                        OF "=W999IO".
000600 Procedure Division.
000700  STOP RUN.