 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROGLIBIMPORT.
 DATA DIVISION.
    PROGRAM-LIBRARY SECTION.
    LB SOMELIB IMPORT
       IS GLOBAL
       IS COMMON
       ATTRIBUTE
          FUNCTIONNAME IS 123 
          LIBACCESS IS BYTITLE
          LIBPARAMETER IS 234 
          TITLE IS 'SOMETITLE'
       ENTRY-PROCEDURE SOMEPROGRAMNAME
           FOR 123
           WITH SOMELOCALNAME1 SOMEFILENAME1
           USING SOMELOCALNAME2 SOMEFILENAME2
           GIVING SOMEDATANAME