 IDENTIFICATION DIVISION.
 PROGRAM-ID. DISPLAYSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PICTURE IS X(9).
 77 SOMEENV1 PICTURE IS 9(1).
 PROCEDURE DIVISION.
    DISPLAY SOMEID1 '2' 3 UPON SOMEENV1 WITH NO ADVANCING.