 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROGLIBEXPORT.
 DATA DIVISION.
    PROGRAM-LIBRARY SECTION.
    LD SOMELIB EXPORT
       ATTRIBUTE SHARING IS PRIVATE
       ENTRY-PROCEDURE SOMEPROGRAMNAME
           FOR 123