 IDENTIFICATION DIVISION.
 PROGRAM-ID. READSTMT.
 PROCEDURE DIVISION.
    READ SOMEFILE1
       NEXT RECORD
       INTO SOMEID1
       WITH WAIT
       KEY IS SOMEID2
       INVALID KEY DISPLAY 'invalid key'
       NOT INVALID KEY DISPLAY 'valid key'
       AT END DISPLAY 'at end'
       NOT AT END DISPLAY 'not at end'.