 IDENTIFICATION DIVISION.
 PROGRAM-ID. SOMEFILEDESC.
 DATA DIVISION.
    FILE SECTION.
    FD PERSON.
    BLOCK CONTAINS 1 TO 5 CHARACTERS
    IS GLOBAL
    IS EXTERNAL
    RECORD IS VARYING IN SIZE 1 TO 5 CHARACTERS DEPENDING ON SOMEDATA.
    01 PERSON-FILE.