 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROLREAD.
 DATA DIVISION.
    DATA-BASE SECTION.
    01 'SOMELITERAL' INVOKE 'SOMELITERAL2'
    02 'SOMELITERAL3' INVOKE 'SOMELITERAL4'
