 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMTQUALIFIED.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMS1.
    02 ITEM1 PIC X(10).
    02 ITEM2 PIC X(10).
 PROCEDURE DIVISION.
     MOVE ITEM1 IN ITEMS1 TO ITEM2.
     MOVE ITEM2 OF ITEMS1 TO ITEM1.