 IDENTIFICATION DIVISION.
 PROGRAM-ID. SOMEFILEDESC.
 DATA DIVISION.
    FILE SECTION.
    FD PERSON.
    BLOCK CONTAINS 1 TO 5 CHARACTERS
    IS GLOBAL
    IS EXTERNAL
    RECORD IS VARYING IN SIZE 1 TO 5 CHARACTERS DEPENDING ON SOMEDATA
    LABEL RECORDS ARE SOMERECNAME1 SOMERECNAME2
    DATA RECORDS ARE SOMEDATANAME1 SOMEDATANAME2
    VALUE OF PERSON IS '1234'
    LINAGE IS 30 LINES 
        WITH FOOTING AT 5
        LINES AT TOP 2
        LINES AT BOTTOM SOMEBOTTOMLINESVAR
    CODE-SET SomeAlphabet
    REPORTS ARE SOMEREPORT1 SOMEREPORT2.
    01 PERSON-FILE.