 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 PROCEDURE DIVISION.
     SUBTRACT CORR SOMEDN1 FROM SOMEDN2 ROUNDED.