 IDENTIFICATION DIVISION.
 PROGRAM-ID. READSTMT.
 PROCEDURE DIVISION.
    START SOMEFILE1
       KEY IS EQUAL TO SOMEDATA1
       INVALID KEY DISPLAY 'invalid key'
       NOT INVALID KEY DISPLAY 'valid key'.