 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  BINARY.
     05  THE-REMAINDER        PIC S9(4).
     05  THE-QUOTIENT         PIC S9(4).
     05  THE-DIVISOR          PIC S9(4).
     05  OFFSET               PIC S9(4).
 01  SOME-DATA-BINARY         PIC 9(1) BINARY.
 01  SOME-DATA-BINARY-USAGE   PIC 9(1) USAGE IS BINARY.