 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMS.
    02 ITEM PICTURE X(10).
    02 ITEMRED REDEFINES ITEM PIC X(5).
    02 ITEMINT INTEGER PIC 9(10).
    02 ITEMSTR STRING PIC X(10).
    02 ITEMEXT EXTERNAL PIC X(10).
    02 ITEMGLB GLOBAL PIC X(10).
    02 ITEMTPD IS TYPEDEF PIC X(10).
    02 ITEMTHR IS THREAD-LOCAL PIC X(10).
    02 ITEMPIC PIC 999.99.
    02 ITEMCOM COMMON PIC 9(1).
    02 ITEMOWN OWN PIC 9(1).
    02 ITEMLOC LOCAL PIC 9(1).
    02 ITEMTYP PIC X(10) TYPE IS LONG-TIME.
    02 ITEMUSN PIC 9(1) USING CONVENTION OF SOMECONV1.
    02 ITEMUSG PIC 9(1) USING LANGUAGE OF SOMELANG2.
    02 ITEMVAL PIC 9(1) VALUES ARE 1 THROUGH 3.
    02 ITEMUSA PIC X(10) USAGE IS DATE.
    02 ITEMCON PIC 9(1) RECEIVED BY CONTENT.
    02 ITEMREF PIC 9(1) RECEIVED BY REFERENCE.
    02 ITEMOCC PICTURE X(10) OCCURS 1 TO 5 TIMES 
        DEPENDING ON SOMEOCCPARAM
        DESCENDING KEY IS SOMEKEY1 SOMEKEY2
        ASCENDING KEY IS SOMEKEY3
        INDEXED BY LOCAL SOMEINDEX1 SOMEINDEX2.
    02 ITEMOCC2 PICTURE X(10) OCCURS ITEM TIMES 
        INDEXED BY SOMEINDEX1
        ASCENDING KEY IS SOMEKEY3.
    02 ITEMSGN PIC 9(1) SIGN IS TRAILING SEPARATE CHARACTER.
    02 ITEMSYN PIC 9(1) SYNCHRONIZED RIGHT.
    02 ITEMJUS PIC 9(1) JUSTIFIED.
    02 ITEMJUR PIC 9(1) JUST RIGHT.
    02 ITEMBLN BLANK WHEN ZERO PIC 9(10).
    02 ITEMLBD PIC X(10) WITH LOWER BOUNDS.
    02 ITEMALI PIC X(10) ALIGNED.
    02 ITEMREC RECORD AREA.
