 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCRREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 PERSON.
    05 BIRTHDATE PIC X(8).
    05 BIRTHDATE-PARTS REDEFINES BIRTHDATE.
       07 BIRTH-YEAR PIC 9(4).
       07 BIRTH-MONTH PIC 9(2).
       07 BIRTH-DAY PIC 9(2).