 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATAVALUE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMNUMERIC	 		VALUE 23.4.
 01 ITEMINTEGER	 		VALUE 42.