 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMS1.
    02 ITEM1 PIC X(10).
    02 ITEM2 PIC X(10).
 01 ITEMS2.