 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATAVALUE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMALL		 		VALUE ALL 2.
 01 ITEMHIGHVALUE 		VALUE HIGH-VALUE.
 01 ITEMHIGHVALUES 		VALUE HIGH-VALUES.
 01 ITEMLOWVALUE 		VALUE LOW-VALUE.
 01 ITEMLOWVALUES 		VALUE LOW-VALUES.
 01 ITEMNULL	 		VALUE NULL.
 01 ITEMNULLS			VALUE NULLS.
 01 ITEMQUOTE	 		VALUE QUOTE.
 01 ITEMQUOTES			VALUE QUOTES.
 01 ITEMSPACE	 		VALUE SPACE.
 01 ITEMSPACES 			PIC X(10) VALUE SPACES.
 01 ITEMZERO 			PIC 9(10) VALUE ZERO.
 01 ITEMZEROS 			PIC 9(10) VALUE ZEROS.
 01 ITEMZEROES 			VALUE ZEROES.