 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATAVALUE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMSPAC 	PIC X(10) VALUE SPACES.
 01 ITEMZER 	PIC 9(10) VALUE ZEROS.