 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATAVALUE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMSTRING	 		VALUE "SOMESTRING".
 01 ITEMHEX	 			VALUE X"02AD".