 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROL.
 ENVIRONMENT DIVISION.
    SPECIAL-NAMES.
        CHANNEL 2 IS SOMEMNEMONIC
        ODT SOMEMNEMONIC.