 IDENTIFICATION DIVISION.
 PROGRAM-ID. SPCLNAMES.
 ENVIRONMENT DIVISION.
    SPECIAL-NAMES.
        CHANNEL 2 IS SOMEMNEMONIC
        ODT SOMEMNEMONIC
        CLASS SOMECLASSNAME FOR NATIONAL SOMEFROM THRU SOMETO SOMEFROM2 THROUGH SOMETO2.