 IDENTIFICATION DIVISION.
 PROGRAM-ID. RETSTMT.
 PROCEDURE DIVISION.
    RETURN SOMEFILE1 RECORD
       INTO SOMEDATA1
       AT END DISPLAY 'at end'
       NOT AT END DISPLAY 'not at end'.