 IDENTIFICATION DIVISION.
 PROGRAM-ID. INTLSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEGRP.
    02 SOMENAME PIC X(30).
    02 SOMEAGE PIC 9(3).
 PROCEDURE DIVISION.
    INITIALIZE SOMEGRP.
    INITIALIZE SOMENAME REPLACING ALPHANUMERIC DATA BY "ABC".
    INITIALIZE SOMENAME IN SOMEGRP.