 IDENTIFICATION DIVISION.
 PROGRAM-ID. ACCEPTSTMT.
 PROCEDURE DIVISION.
     ACCEPT TEST1 FROM TODAYS-NAME.
     ACCEPT TEST2 FROM SOMEMNEMONIC.
     ACCEPT TEST3 MESSAGE COUNT.
     ACCEPT TEST4 FROM ESCAPE KEY.