 IDENTIFICATION DIVISION.
 PROGRAM-ID. REPGRPDESCVERT.
 DATA DIVISION.
    REPORT SECTION.
    RD REPORT1
       IS GLOBAL.
       01 SOMEDATANAME
          LINE NUMBER IS PLUS 2
          USAGE IS DISPLAY
       .