 IDENTIFICATION DIVISION.
 PROGRAM-ID. REPGRPDESCSRC.
 DATA DIVISION.
 REPORT SECTION.
    RD SOME-REPORT.
       01 SOME-GROUP
          SOURCE IS SOME-DATA.
 WORKING-STORAGE SECTION.
    01 SOME-DATA.