 IDENTIFICATION DIVISION.
 PROGRAM-ID. ENSTMT.
 DATA DIVISION.
 COMMUNICATION SECTION.
    CD SOMECDNAME1 FOR INPUT.
    CD SOMECDNAME2 FOR INITIAL I-O.
    CD SOMECDNAME3 FOR OUTPUT.
 PROCEDURE DIVISION.
    ENABLE INPUT TERMINAL SOMECDNAME1 WITH KEY SOMEID1.
    ENABLE I-O TERMINAL SOMECDNAME2 WITH KEY SOMEID2.
    ENABLE OUTPUT SOMECDNAME3 WITH KEY SOMEID3.