000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300    CONFIGSECTION.
000400 AUTHOR.
000500     SOMEAUTH.
000500     SOMEAUTH2.
000600 INSTALLATION.
000700     SOMEINSTALL.
000700     SOMEINSTALL2.
000800 DATE-COMPILED.
000900     SOMECOMPILED.
000900     SOMECOMPILED2.
001000 DATE-WRITTEN.
001100     SOMEWRITTEN.
001100     SOMEWRITTEN2.
001200 SECURITY.
001300     SOMESEC.
001300     SOMESEC2.
001400 REMARKS.
001500     SOMEREM.
001500     SOMEREM2.