000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.
000300    CONFIGSECTION.
000400 AUTHOR.
000500*    SOMEAUTH.
000600 INSTALLATION.
000700*    SOMEINSTALL.
000800 DATE-COMPILED.
000900*    SOMECOMPILED.
001000 DATE-WRITTEN.
001100*    SOMEWRITTEN.
001200 SECURITY.
001300*    SOMESEC.
001400 REMARKS.
001500*    SOMEREM.