000100 Identification Division.
000200 Program-ID. 
000300  CPYLITLIB.
000400 Procedure Division.
000500  COPY CopyBook1 IN 'somelib'.
000600  STOP RUN.