 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETIMES.
 PROCEDURE DIVISION.
   PERFORM PROC1 
     WITH TEST BEFORE 
     VARYING SOMEID FROM 1 BY 2 UNTIL SOMEID = 9.