 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETIMES.
 PROCEDURE DIVISION.
   PERFORM PROC1 
     WITH TEST 
     AFTER UNTIL 1=1.
   PROC1.
     DISPLAY 'test'.