 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMINLINEVARYING.
 PROCEDURE DIVISION.
   PERFORM 
     WITH TEST BEFORE 
     VARYING SOMEID FROM 1 BY 2 UNTIL SOMEID = 9  
       DISPLAY "Test" 
       STOP RUN
   END-PERFORM.