 IDENTIFICATION DIVISION.
 PROGRAM-ID. ALTERSTMT.
 PROCEDURE DIVISION.
    ALTER Paragraph-1 TO PROCEED TO Paragraph-2.

    Paragraph-1.
       GO TO Paragraph-3.
    Paragraph-2.
    Paragraph-3.
