000100 Identification Division.
000200 Program-ID. 
000300  CPYSUBDIR.
000400 Procedure Division.
000500  COPY "copybooks/CopyBook1.cpy".
000500  COPY "cOpYbOoKs/cOpYbOoK2.cpy".
000600  STOP RUN.