       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     CASE-INSENSITIVE.
       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       01  FORT-Struktur.
       PROCEDURE       DIVISION. 
       initialize fort-struktur.