 IDENTIFICATION DIVISION.
 PROGRAM-ID. FUNCTIONCALL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 SOME-DATE PIC 9(8).
 PROCEDURE DIVISION.
    MOVE FUNCTION DATE-OF-INTEGER(
      FUNCTION INTEGER-OF-DATE(SOME-DATE) - 1
    ) TO SOME-DATE.