 IDENTIFICATION DIVISION.
 PROGRAM-ID. INDATACLL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMS1.
    02 ITEM PIC X(10).
 01 ITEMS2.
    02 ITEM PIC X(10).
 PROCEDURE DIVISION.
    DISPLAY ITEM OF ITEMS2.
 