 IDENTIFICATION DIVISION.
 PROGRAM-ID. INDATACLL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 ITEM PIC X(10).
 PROCEDURE DIVISION.
    DISPLAY ITEM OF ITEMS3.
 