 IDENTIFICATION DIVISION.
 PROGRAM-ID. SECTIONCLL.
 DATA DIVISION.
 PROCEDURE DIVISION.
    SOME-PARAGRAPH.
       DISPLAY "".
    SOME-SECTION SECTION.
       SOME-PARAGRAPH.
          PERFORM SOME-PARAGRAPH IN SOME-SECTION.
 