 IDENTIFICATION DIVISION.
   PROGRAM-ID. RECCLL.
 ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
     FILE-CONTROL.
       SELECT FILEIN ASSIGN TO 'filein'
       SELECT FILEOUT ASSIGN TO 'fileout'.
       
 DATA DIVISION.
   FILE SECTION.
     FD FILEIN.
       01 FILEIN-Z.
         05 FILEIN-ID PIC X(1).
         05 FILLER PIC X(42).
     FD FILEOUT.
       01 FILEOUT-Z PIC X(43).

 PROCEDURE DIVISION.
   OPEN 
     INPUT FILEIN 
     OUTPUT FILEOUT.
        
   READ FILEIN.
   WRITE FILEOUT-Z FROM FILEIN-Z.
   
   CLOSE FILEIN FILEOUT.