 IDENTIFICATION DIVISION.
 PROGRAM-ID. SPCLREGCLL.
 PROCEDURE DIVISION.
    ACCEPT ADDRESS OF someid.
    ACCEPT DATE.
    ACCEPT DAY.
    ACCEPT DAY-OF-WEEK.
    ACCEPT DEBUG-CONTENTS.
    ACCEPT DEBUG-ITEM.
    ACCEPT DEBUG-LINE.
    ACCEPT DEBUG-NAME.
    ACCEPT DEBUG-SUB-1.
    ACCEPT DEBUG-SUB-2.
    ACCEPT DEBUG-SUB-3.
    ACCEPT LENGTH OF someid.
    ACCEPT LINAGE-COUNTER.
    ACCEPT LINE-COUNTER. 
    ACCEPT PAGE-COUNTER.
    ACCEPT RETURN-CODE.
    ACCEPT SHIFT-IN.
    ACCEPT SHIFT-OUT.
    ACCEPT SORT-CONTROL.
    ACCEPT SORT-CORE-SIZE.
    ACCEPT SORT-FILE-SIZE.
    ACCEPT SORT-MESSAGE.
    ACCEPT SORT-MODE-SIZE.
    ACCEPT SORT-RETURN.
    ACCEPT TALLY.
    ACCEPT TIME.
    ACCEPT WHEN-COMPILED.
    ACCEPT LENGTH someid.