 IDENTIFICATION DIVISION.
 PROGRAM-ID. TBLCLL.
 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-TBL.
     05 WS-RECORD OCCURS 3 TIMES INDEXED BY I.
       10 WS-DELIMITER PIC A(2).
       10 WS-CONTENT OCCURS 2 TIMES INDEXED BY J.
         20 WS-COLUMN PIC X(3).

 PROCEDURE DIVISION.
   MOVE '12ABCABC34ABCABC56ABCABC' TO WS-TBL.
   PERFORM DISPLAY-RECORD VARYING I FROM 1 BY 1 UNTIL I>3 
   STOP RUN.

   DISPLAY-RECORD.
     PERFORM DISPLAY-CONTENT VARYING J FROM 1 BY 1 UNTIL J>2.
   DISPLAY-CONTENT.
     DISPLAY WS-CONTENT(I,J).