 IDENTIFICATION DIVISION.
 PROGRAM-ID. CM101M.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  COUNTER PIC 9(8).
 PROCEDURE DIVISION.
 INIT.
     ADD 1 TO COUNTER.