 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 TEST1 PIC 9(10).
 77 TEST2 PIC 9(10).
 77 TEST3 PIC 9(10).
 77 TEST4 PIC 9(10).
 77 TEST5 PIC 9(10).
 PROCEDURE DIVISION.
     ADD 1 TO TEST1 GIVING TEST5.
     ADD 1 2 TO TEST2 TEST3 GIVING TEST4 TEST5.
     ADD 0 TO ZERO GIVING TEST1.