 IDENTIFICATION DIVISION.
 PROGRAM-ID. INSPCTSTMT.
 PROCEDURE DIVISION.
    INSPECT SOMEDATA1 
       CONVERTING SOMEDATA2 
          TO SOMEDATA3
          AFTER INITIAL 'A'.
