 IDENTIFICATION DIVISION.
 PROGRAM-ID. MULTSTMT.
 PROCEDURE DIVISION.
    MULTIPLY SOMEID1 BY
       SOMEID2 ROUNDED SOMEID3
       ON SIZE ERROR DISPLAY 'on size error'
       NOT ON SIZE ERROR DISPLAY 'not on size error'.