 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR77.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOME-TEXT PICTURE IS X(9).
 77 SOME-NUMBER PIC 99 COMP.