 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROLREAD.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT PERSON ASSIGN TO 'person.txt'
       ORGANIZATION IS LINE SEQUENTIAL.

 DATA DIVISION.
    FILE SECTION.
    FD PERSON.
    01 PERSON-FILE.
       05 PERSON-ID PIC 9(5).
       05 NAME PIC A(25).

    WORKING-STORAGE SECTION.
    01 WS-PERSON.
       05 WS-PERSON-ID PIC 9(5).
       05 WS-NAME PIC A(25).
    01 WS-EOF PIC A(1).