 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONFIGSECTION.
 ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
       SOURCE-COMPUTER. XYZ WITH DEBUGGING MODE.
       OBJECT-COMPUTER. ZYX 
           MEMORY 8192 CHARACTERS
           DISK 4096 WORDS
           SEGMENT-LIMIT 128.
           