 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONFIGSECTION.
 ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
       SOURCE-COMPUTER. XYZ WITH DEBUGGING MODE.
       OBJECT-COMPUTER. ZYX 
           MEMORY 8192 CHARACTERS
           DISK 4096 WORDS
           COLLATING SEQUENCE Special-Sequence1 Special-Sequence2 
               ALPHANUMERIC Special-Sequence-Alpha 
               NATIONAL Special-Sequence-National
           SEGMENT-LIMIT 128.
           