 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROL.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT TEACHER
       ASSIGN TO 'teacher.txt'
       ORGANIZATION IS RECORD INDEXED
       RESERVE 10.