 IDENTIFICATION DIVISION.
 PROGRAM-ID. COMMDESCINPUT.
 DATA DIVISION.
    COMMUNICATION SECTION.
    CD SOMECD FOR INITIAL INPUT
       SYMBOLIC QUEUE IS SOMEQUEUE
       SYMBOLIC SUB-QUEUE-2 IS SOMESUBQUEUE
       MESSAGE DATE IS SOMEMESSAGEDATE
       MESSAGE TIME IS SOMEMESSAGETIME
       SYMBOLIC SOURCE IS SOMESOURCE
       TEXT LENGTH IS SOMETEXTLENGTH
       END KEY IS SOMEENDKEY
       STATUS KEY IS SOMESTATUSKEY
       MESSAGE COUNT IS SOMEMESSAGECOUNT.
    01 WS-PERSON.
       05 WS-PERSON-ID PIC 9(5).