 IDENTIFICATION DIVISION.
 PROGRAM-ID. COMMDESCINPUT.
 DATA DIVISION.
    COMMUNICATION SECTION.
    CD SOMECD FOR INITIAL I-O
       MESSAGE DATE IS SOMEMESSAGEDATE
       MESSAGE TIME IS SOMEMESSAGETIME
       SYMBOLIC TERMINAL IS SOMETERMINAL
       TEXT LENGTH IS SOMETEXTLENGTH
       END KEY IS SOMEENDKEY
       STATUS KEY IS SOMESTATUSKEY.
    01 WS-PERSON.
       05 WS-PERSON-ID PIC 9(5).