 IDENTIFICATION DIVISION.
 PROGRAM-ID. FILECONTROL.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       I-O-CONTROL.
       X0000001.
       SAME X0000002 X0000003
       MULTIPLE FILE X0000004 POSITION 1
       COMMITMENT CONTROL X0000005
       RERUN ON X0000006 EVERY 1 RECORDS.