 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 TEST1 PIC 9(10).
 77 TEST2 PIC 9(10).
 PROCEDURE DIVISION.
     ADD CORRESPONDING TEST1 TO TEST2.