 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 TEST1 PIC 9(10).
 77 TEST2 PIC 9(10).
 77 TEST3 PIC 9(10).
 77 TEST4 PIC 9(10).
 77 TEST5 PIC 9(10).
 77 TEST6 PIC 9(10).
 77 TEST7 PIC 9(10).
 77 TEST8 PIC 9(10).
 77 TEST9 PIC 9(10).
 PROCEDURE DIVISION.
     ADD 1 TO TEST1.
     ADD 2 3 TO TEST2 TEST3.

     ADD 1 TO TEST4 GIVING TEST5.
     ADD 1 2 TO TEST6 TEST7 GIVING TEST8 TEST9.

     ADD CORRESPONDING TEST1 TO TEST2.