 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 TEST1 PIC 9(10).
 77 TEST2 PIC 9(10).
 77 TEST3 PIC 9(10).
 PROCEDURE DIVISION.
     ADD 1 TO TEST1.
     ADD 2 3 TO TEST2 TEST3.