 IDENTIFICATION DIVISION.
 PROGRAM-ID. DELSTMT.
 PROCEDURE DIVISION.
    DELETE SOMEFILE RECORD
       INVALID KEY DISPLAY 'invalid key'
       NOT INVALID KEY DISPLAY 'valid key'.