 IDENTIFICATION DIVISION.
 PROGRAM-ID. GOTOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 SOMEDATA1 PIC 9.
 PROCEDURE DIVISION.
 SOMEPROC1.
    GO TO SOMEPROC2.
 SOMEPROC2.
    GO TO SOMEPROC3 SOMEPROC4 SOMEPROC5 DEPENDING ON SOMEDATA1.
 SOMEPROC3.
    Display "Proc3".
 SOMEPROC4.
    Display "Proc4".
 SOMEPROC5.
    GO MORE-LABELS.
