 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 PROCEDURE DIVISION.
    SET
       SOMEID1 SOMEID2 TO SOMEID3 SOMEID4
       SOMEID1 TO SOMEID3 ON.