 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 PROCEDURE DIVISION.
    SET
       SOMEID1 SOMEID2 TO SOMEID3 SOMEID4
       SOMEID1 TO SOMEID3 ON.
    SET SOMEID1 TO 'test'.
    SET SOMEID1 TO OFF.
    SET SOMEID1 TO ENTRY SOMEID2.