 IDENTIFICATION DIVISION.
 PROGRAM-ID. GENSTMT.
 DATA DIVISION.
    REPORT SECTION.
    RD REPORT1.
       01 SOMEDATANAME.
 PROCEDURE DIVISION.
    GENERATE REPORT1.