000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500  COPY CopyReplace1 REPLACING This BY Z (1, 2, 3).
000500  COPY CopyReplace2 REPLACING ==That== BY ==DISPLAY==.
000600  STOP RUN.