 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONFIGSECTION.
 AUTHOR. SOMEAUTH.
 INSTALLATION. SOMEINSTALL.
 DATE-COMPILED. SOMECOMPILED.
 DATE-WRITTEN. SOMEWRITTEN.
 SECURITY. SOMESEC.
 REMARKS. SOMEREM.