000050* A Comment line                                                  12345678
000100 Identification Division.                                         12345678
000200 Program-ID.                                                      12345678
000300  HELLOWORLD.                                                     12345678
000400 Procedure Division.                                              12345678
000500  Display "Hello world".                                          12345678
000600  STOP RUN.                                                       12345678