000100 Identification Division.                                         QICE1000
000200 Program-ID.                                                      QICE1000
000300     HELLOWORLD.                                                  QICE1000
004000 Author.                                                          QICE1000
004000     Test " Author '".                                            QICE1000
000400 Procedure Division.                                              QICE1000
000500     Display "Hello world".                                       QICE1000
000600     STOP RUN.                                                    QICE1000