 IDENTIFICATION DIVISION.
 PROGRAM-ID. INITIATESTMT.
 DATA DIVISION.
    REPORT SECTION.
       RD SOMEREPORT1.
          01 SOMEROW1.
       RD SOMEREPORT2.
          01 SOMEROW2.
 PROCEDURE DIVISION.
    INITIATE SOMEREPORT1 SOMEREPORT2.