 IDENTIFICATION DIVISION.
 PROGRAM-ID. TERMINATESTMT.
 PROCEDURE DIVISION.
    WRITE SOMERECORD1 
       FROM SOMEID1
       BEFORE ADVANCING 3 LINES.
       