 IDENTIFICATION DIVISION.
 PROGRAM-ID. DIVSTMT.
 PROCEDURE DIVISION.
    DIVIDE SOMEID1 INTO SOMEID2 GIVING SOMDEID3 ROUNDED REMAINDER SOMEID4.
    DIVIDE SOMEID11 INTO SOMEID12 ROUNDED SOMDEID13 REMAINDER SOMEID14.
    DIVIDE SOMEID21 BY SOMEID22 GIVING SOMDEID23 ROUNDED REMAINDER SOMEID24.