000100 Identification Division.                                         12345678
000100 Program-ID. ExecSqlEmptyLine.                                    12345678
000100 Data Division.                                                   12345678
000100 Working-Storage Section.                                         12345678
000100 EXEC SQL                                                         12345678
000100     SELECT REPLACE('sometext, ',', '.')                          12345678
000100 END-EXEC.                                                        12345678