000000 IDENTIFICATION  DIVISION.                                        12345678
000000 PROGRAM-ID. MIXEDCONTLINES.                                      12345678
000000 PROCEDURE DIVISION.                                              12345678
000000             IF  SOME-DAT                                         12345678
000000                 DISPLAY '     '       SOME-DATA11                12345678
000000                         '          '  SOME-DATA-VALUE1           12345678
000000             END-IF.                                              12345678
000000             IF  SOME-DAT                                         12345678
000000                 DISPLAY '     '       SOME-DATA11                12345678
000000                         '          '  SOME-DATA-VALUE1           12345678
000000             END-IF.                                              12345678
000000                                                                  12345678
000000         IF  SOME-DAT                                             12345678
000000             DISPLAY '------------------------------------------' 12345678
000000-                    '-------------------------------------'      12345678
000000             DISPLAY '     ' SOME-DATA11                          12345678
000000                     '              '                             12345678
000000             DISPLAY '==========================================' 12345678
000000                     '====================================='      12345678
000000         END-IF.                                                  12345678
000000                                                                  12345678
000000         IF  SOME-DAT                                             12345678
000000             DISPLAY '------------------------------------------' 12345678
000000-                    '-------------------------------------'      12345678
000000             DISPLAY '     ' SOME-DATA11                          12345678
000000                     '              '                             12345678
000000                     '     '       SOME-DATA-1                    12345678
000000             DISPLAY '==========================================' 12345678
000000-                    '====================================='      12345678
000000         END-IF.                                                  12345678
000000                                                                  12345678
000000                                                                  12345678
000000     IF  SOME-DAT                                                 12345678
000000         DISPLAY 'some--string              ' SOME-DATA-1         12345678
000000                 '    '                       SOME-DATA           12345678
000000         DISPLAY '=========================================='     12345678
000000                 '====================================='          12345678
000000     END-IF.                                                      12345678
000000                                                                  12345678
000000     IF  SOME-DAT                                                 12345678
000000         DISPLAY 'some--string              ' SOME-DATA-1         12345678
000000                 '    '                       SOME-DATA           12345678
000000         DISPLAY '=========================================='     12345678
000000-                '====================================='          12345678
000000     END-IF.                                                      12345678
000000                                                                  12345678
000000     DISPLAY '  '                                                 12345678
000000     DISPLAY '+-----------------------------------------+'        12345678
000000     DISPLAY '+-----------------------------------------+'        12345678
056850     EXIT.                                                        12345678