000010 IDENTIFICATION DIVISION.                          
000050 PROGRAM-ID.       ABC01 
000060******************************************************************00000000
      * not DOT after the name of the program-id