       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      SOMEPROGRAM.
      *AUTHOR.          SOME-AUTHOR.
      *INSTALLATION.    SOME-INSTALLATION.
      *DATE-WRITTEN.    SOME-DATE-WRITTEN.
      *
       ENVIRONMENT      DIVISION.