 IDENTIFICATION DIVISION.
 PROGRAM-ID. UNSTRNGSTMT.
 PROCEDURE DIVISION.
    UNSTRING 
       SOMEID1 DELIMITED BY '1' OR ALL SOMEID2 OR ALL SOMEID3
       INTO 
          SOMEID4
             DELIMITER IN SOMEID4A
          SOMEID5
             COUNT IN SOMEID5A
       WITH POINTER SOMEID5
       TALLYING IN SOMEID6
       ON OVERFLOW DISPLAY 'on overflow'
       NOT ON OVERFLOW DISPLAY 'not on overflow'.