 IDENTIFICATION DIVISION.
 PROGRAM-ID. COND.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMECOND PICTURE IS 9(1).
 PROCEDURE DIVISION.
    IF 1 > 2 OR NOT SOMECOND THEN
       DISPLAY 'some text'
    END-IF.