 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 LOCAL-STORAGE SECTION.
 LD SOMELD.
 01 ITEMS.
    02 ITEM1 PIC X(10).
    02 ITEM2 PIC X(10).