 IDENTIFICATION DIVISION.
 PROGRAM-ID. USESTMT.
 PROCEDURE DIVISION.
    DECLARATIVES.
       SOMESECTION1 SECTION.
          USE FOR DEBUGGING ON ALL REFERENCES OF SOMEID1
                               ALL PROCEDURES
                               SOMEPROC1.
       SOMESECTION2 SECTION.
          USE GLOBAL AFTER EXCEPTION PROCEDURE ON SOMEFILE1.
    END DECLARATIVES.
    SOMESECTION1.
       EXIT.
    SOMESECTION2.
       EXIT.