 IDENTIFICATION DIVISION.
 PROGRAM-ID. STRNGSTMT.
 PROCEDURE DIVISION.
    STRING 
       SOMEID1 DELIMITED BY '1'
       SOMEID2 FOR SOMEID3
       INTO SOMEID4
       WITH POINTER SOMEID5
       ON OVERFLOW DISPLAY 'on overflow'
       NOT ON OVERFLOW DISPLAY 'not on overflow'.