       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDSTMT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
          ADD 0 TO ZERO GIVING RETURN-CODE.
