000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Data Division.
000400 Working-Storage Section.
000400 02 FILLER PICTURE X(14) VALUE IS
000400     "AB COPY, TEST.".
000400 Procedure Division.
000500  Display "COPY ,".
000500  Display "COPY,".
000600  STOP RUN.