000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
055000 ADD COPY CopyInAddBook. TO Var1.
055200 IF Var1 EQUAL TO 12345
009000 GO TO JMP-1.