000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Data Division.
000400 Working-Storage Section.
000400 01 VAR   COPY CopyInPictureBook.