000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500  COPY CopyReplaceLinebreakBook REPLACING ==This is a Line Break== BY ==DISPLAY==.
000600  STOP RUN.