000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500  COPY CopyNewLineBook
000501  .
000600  STOP RUN.