       Identification Division.
       Program-ID. ExecSqlCpy.
       Procedure Division.
        EXEC SQL 
           SELECT SMTBL.SM_COPY
        END-EXEC.
        STOP RUN.