000100 Identification Division.
000200 Program-ID. LTRL.
000400 Procedure Division.
000500  Display "Hello world".
000500  Display 'Hello world'.
000500  Display 1.
000500  Display ZERO.
000500  Display X"40".
000500  Display X'40'.
000500  Display Z"Hello world".
000500  Display Z'Hello world'.
