000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500   MOVE "Test" TO TESTVAR.
000500   MOVE ALL ZEROS TO TESTVAR.
