000100 Identification Division.
000200 Program-ID. 
000300  HELLOWORLD.
000400 Procedure Division.
000500  REPLACE ==Thi==  BY ==ERROR==
000599          ==This== BY ==DISPLAY==.
000600  This "Hello world".
000700  REPLACE OFF.
000800  STOP RUN.