       Identification Division.
       Program-ID. STRNGSTMT.
       Procedure Division.
           STRING '2016' FUNCTION CURRENT-DATE(1:16) DELIMITED BY SIZE INTO SOMEDATA1 END-STRING.
           STRING 'SOME-STRING',SOME-DATA1 DELIMITED BY SIZE INTO SOME-DATA2.