 IDENTIFICATION DIVISION.
 PROGRAM-ID. SPCLNAMES.
 ENVIRONMENT DIVISION.
    SPECIAL-NAMES.
        CHANNEL 2 IS SOMEMNEMONIC
        ODT SOMEMNEMONIC
        CLASS SOMECLASSNAME FOR NATIONAL SOMEFROM THRU SOMETO SOMEFROM2 THROUGH SOMETO2
        CURRENCY SIGN 'E' PICTURE SYMBOL '-'
        DECIMAL-POINT IS COMMA
        RESERVE WORDS NETWORK
        SYMBOLIC CHARACTERS NATIONAL ABC IS 1 IN SOMEALPHABET
        DEFAULT-DISPLAY TRAILING
        ALPHABET SOMEALPHABET1 FOR NATIONAL IS NATIVE
        ALPHABET SOMEALPHABET2 FOR NATIONAL IS CCSVERSION 123
        ALPHABET SOMEALPHABET3 FOR ALPHANUMERIC IS EBCDIC
        ALPHABET SOMEALPHABET4 FOR ALPHANUMERIC IS SOMECOBOLWORD
        ALPHABET SOMEALPHABET5 FOR ALPHANUMERIC IS 1 ALSO 7 8 ALSO 11
        .